20250119133757-journal_backend_01192025.org
:PROPERTIES:
:ID:       2d3bd225-8625-4eda-a3d8-d771e5f5573a
:END:
#+title: Journal - Backend - 01192025
#+category: JOURNAL
#+filetags: :backend:programming:journal:

*13:38*: I'll continue with the implementation of the [[id:2afffeb2-abc4-47b0-877b-d8165d99e8e0][Practice Project - Table Printer]]. This will be quick because I implemented it two days ago, but I didn't documented it.
*13:50*: I finished the implementation section of the project [[id:2afffeb2-abc4-47b0-877b-d8165d99e8e0][Practice Project - Table Printer]]. Let's go with [[id:6faa52ba-61b6-4011-89bb-4875e1998de6][Practice Project - Zombie Dice Bots]], the goal is to at least do the planning section.
*15:40* I just ended the planning section for [[id:6faa52ba-61b6-4011-89bb-4875e1998de6][Practice Project - Zombie Dice Bots]], now I will rest.
*19:18* I return, now I will do the implementation of [[id:6faa52ba-61b6-4011-89bb-4875e1998de6][Practice Project - Zombie Dice Bots]]
*19:35*: I Finished the implementation for [[id:6faa52ba-61b6-4011-89bb-4875e1998de6][Practice Project - Zombie Dice Bots]], and with that I have finished all the practice project of the chapter 1 from [[id:cdd2475f-a203-40ee-9bc7-809bb125cf3e][Book - Automate The Boring Stuff With Python]]
* To-Do's
- [X] Do the exercises of the chapter (table printer, zombie dice bots)
  - [X] [[id:2afffeb2-abc4-47b0-877b-d8165d99e8e0][Practice Project - Table Printer]]
  - [X] [[id:6faa52ba-61b6-4011-89bb-4875e1998de6][Practice Project - Zombie Dice Bots]]
- [ ] Do the note for strings in python [[id:ac87cf3d-84bf-4db2-8c0c-4a8acc0961f9][Python Strings]]

