notes-md/20250119133757-journal_backend_01192025.md

# Table of Contents

1.  [To-Do's](#org130ae39)

**13:38**: I'll continue with the implementation of the [Practice Project - Table Printer](20250118005430-practice_project_table_printer.md). This will be quick because I implemented it two days ago, but I didn't documented it.
**13:50**: I finished the implementation section of the project [Practice Project - Table Printer](20250118005430-practice_project_table_printer.md). Let's go with [Practice Project - Zombie Dice Bots](20250118005506-practice_project_zombie_dice_bots.md), the goal is to at least do the planning section.
**15:40** I just ended the planning section for [Practice Project - Zombie Dice Bots](20250118005506-practice_project_zombie_dice_bots.md), now I will rest.
**19:18** I return, now I will do the implementation of [Practice Project - Zombie Dice Bots](20250118005506-practice_project_zombie_dice_bots.md)
**19:35**: I Finished the implementation for [Practice Project - Zombie Dice Bots](20250118005506-practice_project_zombie_dice_bots.md), and with that I have finished all the practice project of the chapter 1 from [Book - Automate The Boring Stuff With Python](20250109061737-book_automate_the_boring_stuff_with_python.md)


<a id="org130ae39"></a>

# To-Do's

-   [X] Do the exercises of the chapter (table printer, zombie dice bots)
    -   [X] [Practice Project - Table Printer](20250118005430-practice_project_table_printer.md)
    -   [X] [Practice Project - Zombie Dice Bots](20250118005506-practice_project_zombie_dice_bots.md)
-   [X] Do the note for strings in python [Python Strings](20250114133247-python_strings.md)

